Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/telecommunications_and_postal_services/eircode.html.txt.tmx
Source language: en
Languages: ga

source: • How to use your Eircode
ga: • Conas do Eircode a úsáid

source: In July 2015, a new national postcode system known as Eircode was introduced
ga: In Iúil 2015, tugadh córas nua náisiúnta postchóid isteach ar a dtugtar Eircode

source: All residential and business addresses have been given a unique new Eircode
ga: Tugadh Eircode nua uathúil do gach seoladh cónaithe agus gnó

source: Residential addresses include every address where post is delivered
ga: Áirítear le seoltaí cónaithe gach seoladh a ndéantar post a seachadadh chuige

source: Each house on a street, each flat in an apartment block, each unit in a duplex unit and each house in a rural townland has been given an Eircode
ga: Tugadh Eircode do gach teach ar shráid, gach árasán i mbloc árasán, gach aonad in aonad árasán dhá urlár agus gach teach i mbaile fearainn tuaithe

source: In a halting site with numbered bays, each bay has been given an Eircode
ga: I láithreán stad ina bhfuil bánna uimhrithe, tugadh Eircode do gach bá

source: The Eircode does not belong to the caravan but to the bay in which it resides
ga: Ní bhaineann an Eircode leis an gcarbhán ach leis an mbá ina bhfuil sé suite

source: If a caravan or mobile home within a bay moves from the bay, the bay retains the Eircode
ga: Má bhogann carbhán nó teach soghluaiste laistigh de bhá ón mbá, coimeádann an bá an Eircode

source: If a halting site has an office that receives mail, the office address will get an Eircode
ga: Má tá oifig i láithreán stad a seoltar an post chuige, gheobhaidh seoladh na hoifige sin Eircode

source: An Eircode is a unique 7-character code consisting of letters and numbers
ga: Cód uathúil seacht gcarachtar é Eircode ina bhfuil litreacha agus uimhreacha

source: Each Eircode consists of a 3-character routing key to identify the area and a 4-character unique identifier for each address, for example, A65 F4E2
ga: Tá eochair ródaithe 3 charachtar i ngach Eircode chun an ceantar a shainaithint mar aon le aitheantóir uathúil ceithre charachtar do gach seoladh, mar shampla, A65 F4E2

source: The routing key is the first 3 characters of an Eircode
ga: Is é an eochair ródaithe an chéad trí charachtar de Eircode

source: The first character is always a letter, followed by 2 numbers (except for D6W)
ga: Litir a bhíonn i gceist leis an gcéad charachtar, agus dhá uimhir ina dhiaidh (seachas i gcás D6W)

source: The letters are not linked to a county or city name, except for postal districts in Dublin, which have had their existing postal codes transferred into a routing key format such as D03, D12 and D22
ga: Níl na litreacha nasctha le hainm contae nó cathrach, seachas i gcás postcheantar i mBaile Átha Cliath, a ndearnadh a bpostchóid reatha a aistriú isteach i bhformáid Eochair ródaithe, ar nós D03, D12, D15 agus D22

source: The same routing key can be shared by several towns and townlands
ga: Féadfaidh roinnt bailte agus bailte fearainn an eochair ródaithe chéanna a úsáid

source: The unique identifier is a group of 4-characters and comes after the routing key
ga: Is é an t-aitheantóir uathúil grúpa de cheithre charachtar agus tagann sé i ndiaidh na heochrach ródaithe

source: Each unique identifier is different and unique to your home or premises
ga: Tá gach Aitheantóir Uathúil éagsúil agus uathúil i dtaobh do bhaile nó áitribh

source: They are not in sequence
ga: Ní bhíonn siad i sraith

source: This is to avoid the situation where a new building is created between two existing ones, and the code sequence would be broken, requiring all Eircodes in the area to be changed
ga: Is amhlaidh atá seo chun an cás a sheachaint ina gcruthaítear foirgneamh nua idir dhá fhoirgneamh reatha, agus go mbrisfí sraith na gcód, agus ina mbeadh gá gach Eircode sa cheantar a athrú

source: How to use your Eircode
ga: Conas do Eircode a úsáid

source: The Eircode should be placed at the end of your normal address, just below the County
ga: Ba cheart an Eircode a lua ag deireadh do ghnáthsheolta, díreach faoi bhun an Chontae

source: If you are writing to a person in Ireland from overseas, the Eircode should go between the County and Country details
ga: Má tá tú ag scríobh chuig duine in Éirinn ó áit thar lear, ba cheart an Eircode a lua idir na sonraí faoin Tír agus an Contae

source: The use of Eircode is not mandatory
ga: Níl úsáid an Eircode éigeantach

source: However, it is likely that organisations will ask you for your Eircode, especially those delivering goods or services to your address
ga: Is dóchúil go n-iarrfaidh eagraíochtaí ort, áfach, do Eircode a thabhairt, go háirithe na heagraíochtaí siúd a dhéanann earraí nó seirbhísí a sheachadadh chuig do sheoladh

source: You should only give your Eircode to people or companies that you would be happy to give your address to
ga: Níor cheart duit do sheoladh a thabhairt ach do dhaoine nó do chuideachtaí a mbeifeá sásta do sheoladh a thabhairt dóibh

source: There is no personal data on the Eircode database or Eircode Finder
ga: Níl aon sonraí pearsanta ar bhunachar sonraí Eircode nó in Aimsitheoir Eircode

source: It does include business names, which in some cases can be the name of an individual, particularly for small businesses or sole traders
ga: Áirítear leis ainmneacha gnó, a bhféadfadh ainm duine aonair a bheith i gceist leo, go háirithe i dtaobh gnólachtaí beaga nó trádálaithe aonair

source: You do not apply for an Eircode
ga: Ní dhéanann tú iarratas ar Eircode

source: The information shown on the Eircode Finder is based on information received from An Post GeoDirectory
ga: Tá an fhaisnéis a thaispeántar ar Aimsitheoir Eircode bunaithe ar fhaisnéis a fuarthas ó Logeolaire An Post

source: As An Post update their information and it is passed to Eircode, any changes will be reflected on the Eircode Finder
ga: De réir mar a nuashonraíonn An Post a bhfaisnéis agus go gcuirtear ar aghaidh í chuig Eircode, léireofar aon athruithe in Aimsitheoir Eircode

source: Each quarter, Eircode will receive an update with any new properties
ga: Gach ráithe, gheobhaidh Eircode nuashonrú ina mbeidh aon réadmhaoin nua

source: At this time any new address will be assigned an Eircode and an Eircode letter will be sent to the occupier of that address
ga: Ag an tráth seo, sannfar Eircode chuig aon seoladh nua agus seolfar litir Eircode chuig áititheoir an tseolta sin

source: It is likely that if your address is not listed on the current Eircode Finder that it will be in one of the future versions of the Eircode Finder
ga: Is dóchúil, mura bhfuil do sheoladh liostaithe ar an Aimsitheoir Eircode reatha, go mbeidh sé i gceann de na leaganacha d’Aimsitheoir Eircode amach anseo

source: Eircode cannot change the postal address information available on the Eircode Finder unless instructed to do so by An Post GeoDirectory
ga: Ní féidir le Eircode an fhaisnéis faoi sheoladh poist atá ar fáil ar Aimsitheoir Eircode a athrú mura n-ordaíonn Logeolaire (GeoDirectory) An Post chun amhlaidh a dhéanamh

source: If your address in the Eircode Finder is incorrect, it is recommended that you carry on using the address you normally use and simply add the Eircode
ga: Má tá do sheoladh in Aimsitheoir Eircode mícheart, moltar go leanann tú ar aghaidh agus an seoladh a úsáideann tú de ghnáth a úsáid agus gan ach an Eircode a chur leis

source: You can find or check an Eircode using the Eircode Finder
ga: Féadfaidh tú Eircode a aimsiú nó a sheiceáil agus leas á bhaint as Aimsitheoir Eircode
